Revit 2024 API
MEPSize Constructor
 Constructs an object that stores the basic size information for MEP duct, pipe, cable tray and conduit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public MEPSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	bool usedInSizeLists,
	bool usedInSizing
)
Visual Basic
Public Sub New ( _
	nominalDiameter As Double, _
	innerDiameter As Double, _
	outerDiameter As Double, _
	usedInSizeLists As Boolean, _
	usedInSizing As Boolean _
)
Visual C++
public:
MEPSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	bool usedInSizeLists,
	bool usedInSizing
)
Parameters
nominalDiameter
Type: System.Double
 Nominal diameter. The value should be a valid, positive Revit length.
innerDiameter
Type: System.Double
 Inner diameter. The value should be a valid, positive Revit length.
outerDiameter
Type: System.Double
 Outer diameter. The value should be a valid, positive Revit length.
usedInSizeLists
Type: System.Boolean
 Whether it is used in size lists.
usedInSizing
Type: System.Boolean
 Whether is used in sizing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for nominalDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for innerDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for outerDiameter must be greater than 0 and no more than 30000 feet.
See Also
MEPSize Class
Autodesk.Revit.DB Namespace